In [5]:
import pandas as pd
df=pd.read_csv('C:/Users/GPT BANTWAL/Documents/weather1.csv')
df

   Unnamed: 0     city  temperature  humidity
0           0  newyork           70        68
1           1  beijing           67        70
2           2   mumbai           68        70

In [6]:
df.pivot(index='city',columns='temperature')

            Unnamed: 0           humidity
temperature         67   68   70       67    68    70
city
beijing            1.0  NaN  NaN     70.0   NaN   NaN
mumbai             NaN  2.0  NaN      NaN  70.0   NaN
newyork            NaN  NaN  0.0      NaN   NaN  68.0